---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.AnalyticalPanel
source: html/c4fea2dd-0466-37e5-1910-3502dcaa9c81.htm
---
# AnalyticalPanel Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.